MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK40DX128VMC7/mcu.h
#define FGM[31:0]                     0x7FFFFFFF80000000      // Rx FIFO Global Mask Bits


//*****************************************************************************
//
// The following are defines for the bit fields in the CANx_RXFIR register.
//
//*****************************************************************************

#define IDHIT                         0x0001FF00      // Identifier Acceptance Filter Hit Indicator


//*****************************************************************************
//
// The following are defines for the bit fields in the CANx_RXIMRn register.
//
//*****************************************************************************

#define MI[31:0]                      0x7FFFFFFF80000000      // Individual Mask Bits


//*****************************************************************************
//
// The following are defines for the bit fields in the Message_buffer_structure register.
//
//*****************************************************************************

#define CODE                          0x780000000      // Message Buffer Code
#define SRR                           0x08000000      // Substitute Remote Request
#define IDE                           0x04000000      // ID Extended Bit
#define RTR                           0x02000000      // Remote Transmission Request
#define DLC                           0x1F000000      // Length of Data in Bytes
#define TIME STAMP                    0x7FFFF80000      // Free-Running Counter Time Stamp
#define PRIO                          0x70000000      // Local priority
#define ID                            0x7FFFE0000      // Frame Identifier


//*****************************************************************************
//
// The following are defines for the bit fields in the Rx_FIFO_structure register.
//
//*****************************************************************************

#define SRR                           0x780000000      // Substitute Remote Request
#define IDE                           0x08000000      // ID Extended Bit
#define RTR                           0x04000000      // Remote Transmission Request
#define DLC                           0x7E000000      // Length of Data in Bytes
#define TIME STAMP                    0x7FFFF80000      // Free-Running Counter Time Stamp


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_GCR register.
//
//*****************************************************************************

#define Regulated Voltage Enable      0x80000000      // Enables internal voltage regulator. It must have the charge pump enabled.
#define Regulated Voltage Trim        0x78000000      // This 4-bit trim register is used to adjust the regulated input. Each bit in the register has equal weight. The regulated input is changed by 1.5% for each count.
#define Charge Pump or Resistor Bias Select0x00800000      // Selects the LCD controller charge pump or a resistor network to supply the LCD voltages V LL1   ,  V  LL2       , and V LL3 .
#define High Reference Select         0x00400000      // When using the V IREG inputs, this bit configures internal circuits to supply V LL1 .
#define Load Adjust                   0x00600000      // Configures SLCD to handle different LCD glass capacitance.
#define LCD Frame Frequency Interrupt Enable0x00008000      // Enables an LCD interrupt event that coincides with the LCD controller frame frequency.
#define LCD Fault Detection Complete Interrupt Enable0x00004000      // Enables an LCD interrupt event when fault detection is completed.
#define LCD AlternateClock Divider    0x00006000      // Functions as a clock divider to divide the alternate clock before it is selected as LCD clock source.
#define LCD Wait                      0x00000200      // LCD driver, charge pump, resistor bias network, and voltage regulator stop while in Wait mode.
#define LCD Stop                      0x00000100      // LCD driver, charge pump, resistor bias network, and voltage regulator stop while in Stop mode.
#define LCD Driver Enable             0x00000080      // Starts LCD controller waveform generator.
#define LCD Clock Source Select       0x00000040      // The LCD controller has two possible clock sources. This bit is used to select which clock source is the basis for LCD clock.
#define LCD Clock Prescaler           0x000000E0      // Used as a clock divider to generate the SLCD frame frequency. LCD controller duty cycle configuration           is used to determine the LCD controller frame frequency. LCD controller frame frequency calculations are provided in SLCD base clock and frame frequency .
#define LCD duty select               0x0000001C      // Selects the duty cycle of the LCD controller driver.


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_AR register.
//
//*****************************************************************************

#define LCD Frame Frequency Interrupt flag0x00008000      // Indicates a frame frequency interrupt condition has occurred. To   clear  the interrupt,  write 1  to LCDIF.
#define Blink command                 0x00000080      // Starts or stops SLCD blinking.
#define Alternate display mode        0x00000040      // For four back planes or less, the LCD back plane sequencer changes to output an alternate display. ALT bit is ignored if DUTY[2:0] is 101 or greater.
#define Blank display mode            0x00000020      // Asserting this bit clears all segments in the LCD.
#define Blink mode                    0x00000010      // Selects the blink mode displayed during the blink period.
#define Blink-rate configuration      0x0000001C      // Selects frequency at which the LCD blinks when the BLINK bit is asserted. The following equation provides an expression for the LCD controller blink rate and shows how BRATE field is used in the LCD blink-rate calculation.


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_FDCR register.
//
//*****************************************************************************

#define Fault Detect Clock Prescaler  0x0001C000      // Fault detect sample clock frequency is:
#define Fault Detect Sample Window Width0x00003800      // Specifies the sample window width of fault detection, in number of cycles in the range from 4–512 (Sample window = 4*2 N ).
#define Fault Detect Enable           0x00000100      // If LCDEN is 1, asserting FDEN inserts a test frame after normal LCD refresh frame is completed. After the test frame is done, Fault detection complete flag (FDCF) is set. When the test frame is done, a normal LCD refresh frame starts. FDEN is one-shot register, it clears after FDCF is set.
#define Fault Detect Back Plane Enable0x00000080      // Enables "back plane" timing for the fault detect circuit. FDBPEN = 0 generates front plane timing. This bit specifies the type of pin selected under fault detect test.
#define Fault Detect Pin ID           0x000007E0      // Specifies the LCD pin to be checked by pullup fault detection.


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_FDSR register.
//
//*****************************************************************************

#define Fault Detection Complete Flag 0x00008000      // FDCF indicates that the fault detection is completed. Writing 1 to this bit clears it to zero. This bit also acts as an interrupt flag when FDCIEN is set. Software can use either interrupt or polling to check whether one pin fault detection is completed.
#define Fault Detect Counter          0x00007F80      // Contains how many “one/high” are sampled inside the fault detect sample window.


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_PENn register.
//
//*****************************************************************************

